abisheksethu/UCOS_EDF_SRP/ce4053/Micrium/Software/EvalBoards/TI/LM3S9B92-EVALBOT/IAR/uCOS-III-CE4053_PG/OS_RecTask.c
/*
*********************************************************************************************************
*                                              TASK RECURSION CODE
*
*               All rights reserved.  Protected by international copyright laws.
*               Knowledge of the source code may NOT be used to develop a similar product.
*               Please help us continue to provide the Embedded community with the finest
*               software available.  Your honesty is greatly appreciated.
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*
*                                            TASK RECURSION CODE
*
* Filename      : OS_RecTask.c
* Version       : V1.00
* Programmer(s) : Team Tesla
*
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                             INCLUDE FILES
*********************************************************************************************************
*/

#include <includes.h>
#include <stdio.h>
#include "driverlib/timer.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include <os.h>

/*
*********************************************************************************************************
*                                            GLOBAL VARIABLES
*********************************************************************************************************
*/
static CPU_INT32U  counter;
extern Tree * root;
/*
*********************************************************************************************************
*                                         FUNCTION PROTOTYPES
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                          CREATE RECURSIVE TASKs
*
* Description : This function is called by Timer0A interrupt handler. Based on the task set registered 
*               in the datastructure, it will create a new task with respective to its release time
*
* Arguments   : none
*
* Returns     : none
*
* Notes       :
*               
*********************************************************************************************************
*/

void  OSTaskHandler (void)
{ 
  CPU_INT32U rel_time = 0;
  CPU_INT32U entry = 0;
  CPU_INT32U abs_deadline = 0;
  Tree *min;
  /*--------------- FIND MINIMUM TASK RELEASE TIME -------*/    
  min = find_min(root);
  if( min->release_time == counter )
  { 
    entry = min->entries;
    for(int i=0; (i < entry && i <= NUM_OF_TASKS); i++)
    {
      if(min->p_tcb[i]!= NULL)
      {         
        /* --------------- SAVE ABSOlUTE RELEASE PERIOD AND ABSOLUTE DEADLINE FOR A TASK -------*/
        rel_time = counter + (min->p_tcb[i]->TaskPeriod);
        abs_deadline = counter + (min->p_tcb[i]->TaskDeadline);
        min->p_tcb[i]->TaskRelPeriod = rel_time;
        min->p_tcb[i]->TaskAbsDeadline = abs_deadline;
        /* --------------- ADD TCB TO READY LIST -------*/
        OSTaskInsertTCB(min->p_tcb[i]);
        /* --------------- ADD TASK TO TASK RECURSION LIST -------*/
        root = insert(rel_time, root, min->p_tcb[i]);
        /* --------------- ADD TASK TO SCHEDULING LIST -------*/
        /* --------------- REMOVE TCB FROM TASK RECURSION LIST -------*/
        root = delete_node(min->release_time, root);
      }
      else {
      }
    } 
  }
  else {
  
  }
  /* Update the local counter and boundary check */
  counter = counter + 1; 
}
/*
*********************************************************************************************************
*                                          ADD TCB TO READY LIST
*
* Description : Add TCB to ready list with the stack ptr and state as ready
*              
*
* Arguments   : tcb
*
* Returns     : none
*
* Notes       :
*               
*********************************************************************************************************
*/
void OSTaskInsertTCB(OS_TCB *p_tcb) 
{
  CPU_STK *p_sp;
  CPU_STK_SIZE  i;
                                                                 /* --------------- CLEAR THE TASK'S STACK --------------- */
  if ((p_tcb->Opt & OS_OPT_TASK_STK_CHK) != (OS_OPT)0) {         /* See if stack checking has been enabled                 */
      if ((p_tcb->Opt & OS_OPT_TASK_STK_CLR) != (OS_OPT)0) {     /* See if stack needs to be cleared                       */
          p_sp = p_tcb->StkBasePtr;
          for (i = 0u; i < p_tcb->StkSize; i++) {               /* Stack grows from HIGH to LOW memory                    */
              *p_sp = (CPU_STK)0;                               /* Clear from bottom of stack and up!                     */
              p_sp++;
          }
      }
  }
  
  p_sp = OSTaskStkInit(p_tcb->TaskEntryAddr,
                       p_tcb->TaskEntryArg,
                       p_tcb->StkBasePtr,
                       p_tcb->StkLimitPtr,
                       p_tcb->StkSize,
                       p_tcb->Opt);
  
  p_tcb->StkPtr    = p_sp;                                /* Save the new top-of-stack pointer      */ 
  p_tcb->TaskState = (OS_STATE)OS_TASK_STATE_RDY;         /* Indicate that the task in READY STATE  */
  
  CPU_SR_ALLOC();
                                                          /* --------------- ADD TASK TO READY LIST --------------- */
  OS_CRITICAL_ENTER();
  OS_PrioInsert(p_tcb->Prio);                             //Remove
  OS_RdyListInsertTail(p_tcb);
  OSTaskQty++;                                            /* Increment the #tasks counter                           */
  if (OSRunning != OS_STATE_OS_RUNNING) {                 /* Return if multitasking has not started                 */
      OS_CRITICAL_EXIT();
      return;
  }    
  OS_CRITICAL_EXIT_NO_SCHED();
  OSSched();                                              /* EDF Scheduling */
  //OSEDFSched(p_err);
}


/*$PAGE*/
